In [2]:
import pandas as pd
from validate_email import validate_email
import re
import numpy as np
df =pd.read_csv('Maternidad y bebes 2022.xlsx - Copia de LP.csv')

In [3]:
df.columns

Index(['identificacionUsuario', 'correoElectronico', 'nombreCliente',
       'celular', 'VentasLopido', 'Ciudad', 'Departamento'],
      dtype='object')

In [4]:
df.nombreCliente.head()

0                   Erika Yuliana
1                   Viviana Gomez
2                   Erika Yuliana
3    Sergioalexander Perdomorivas
4        Juanandres Camachoquiroz
Name: nombreCliente, dtype: object

In [5]:
df['nombreCliente'] =df['nombreCliente'].str.capitalize()
df.nombreCliente.head()

0                   Erika yuliana
1                   Viviana gomez
2                   Erika yuliana
3    Sergioalexander perdomorivas
4        Juanandres camachoquiroz
Name: nombreCliente, dtype: object

In [6]:
df['correoElectronico'].head(5)

0                    at@sena.com
1                   aah@sena.com
2    sergioalexander@hotmail.com
3         juanandres@hotmail.com
4              natha@hotmail.com
Name: correoElectronico, dtype: object

In [7]:
df['valid_email'] = df['correoElectronico'].apply(lambda x:validate_email(x))
df['correoElectronico'] = df['correoElectronico'].str.lower()
df[df['valid_email']== True].head()

,identificacionUsuario,correoElectronico,nombreCliente,celular,VentasLopido,Ciudad,Departamento,valid_email
0,11000000019,at@sena.com,Erika yuliana,3.000000e+09,20450,Garzon,Huila,True
1,11000000047,aah@sena.com,Viviana gomez,3.000000e+09,21300,Neiva,Huila,True
2,11000000061,sergioalexander@hotmail.com,Erika yuliana,3.000000e+09,21300,Neiva,Huila,True
3,83254781,juanandres@hotmail.com,Sergioalexander perdomorivas,3.000000e+09,18450,Neiva,Huila,True
4,1010218223,natha@hotmail.com,Juanandres camachoquiroz,3.000000e+09,18450,Neiva,Huila,True

In [8]:
df['celular']=df['celular'].astype('str')
df['celular']=df['celular'].str.slice(0,10)#extraer una sub cadena de la coluna
telefono=df['celular']

In [9]:
telefono
patron= '^[3]\d{9}$'
validar= re.compile(patron)
valido=[]

In [10]:
for t in telefono:
    valido.append('si'  if validar.search(t) is not None else 'no')

In [11]:
telef=pd.Series(valido) 
df['validos']=telef   
df[df.validos=='no'].head()

,identificacionUsuario,correoElectronico,nombreCliente,celular,VentasLopido,Ciudad,Departamento,valid_email,validos
7432,10965765,amandaluzpolop2979@hotmail.com,Samir sierra,nan,58400,Monteria,Cordoba,True,no
7433,10965753,crhistiancf8@gmail.com,Zahid sierra cassiany,nan,31350,Monteria,Cordoba,True,no
7434,1084235749,danielcastellon@gmail.com,Amanda pedrozo,nan,34650,Barranquilla,Atlantico,True,no
7435,1001943197,caroli85@hotmail.com,Cristian castañeda,nan,40900,Barranquilla,Atlantico,True,no
7436,1065605007,ventasangel1234@hotmail.com,Daniel castellon,nan,61830,Valledupar,Cesar,True,no

In [12]:

df[df.celular=='nan'].replace('nan','').head()
df['celular']=df['celular'].replace('nan','')

In [13]:
del df ['valid_email']
del df ['validos']
df.head()

,identificacionUsuario,correoElectronico,nombreCliente,celular,VentasLopido,Ciudad,Departamento
0,11000000019,at@sena.com,Erika yuliana,3000000021,20450,Garzon,Huila
1,11000000047,aah@sena.com,Viviana gomez,3000000048,21300,Neiva,Huila
2,11000000061,sergioalexander@hotmail.com,Erika yuliana,3000000062,21300,Neiva,Huila
3,83254781,juanandres@hotmail.com,Sergioalexander perdomorivas,3000000068,18450,Neiva,Huila
4,1010218223,natha@hotmail.com,Juanandres camachoquiroz,3000000069,18450,Neiva,Huila

In [14]:
def Renombrar_columna(df1, columna,nuevacolumn):
    if columna in df1:
        df1=df1.rename({columna:nuevacolumn},axis=1)
        return df1
    else:
        print("la columna no existe")
        return df1

In [16]:
df=Renombrar_columna(df,'nombreCliente','Nombre')
df=Renombrar_columna(df,'celular','Telefono')
df=Renombrar_columna(df,'correoElectronico','Emails')
df.head()

la columna no existe
la columna no existe
la columna no existe

,identificacionUsuario,Emails,Nombre,Telefono,VentasLopido,Ciudad,Departamento
0,11000000019,at@sena.com,Erika yuliana,3000000021,20450,Garzon,Huila
1,11000000047,aah@sena.com,Viviana gomez,3000000048,21300,Neiva,Huila
2,11000000061,sergioalexander@hotmail.com,Erika yuliana,3000000062,21300,Neiva,Huila
3,83254781,juanandres@hotmail.com,Sergioalexander perdomorivas,3000000068,18450,Neiva,Huila
4,1010218223,natha@hotmail.com,Juanandres camachoquiroz,3000000069,18450,Neiva,Huila